{
  "flow_type": "data_list",
  "flow_name": "story",
  "status": "released",
  "rows": [
    {
      "id": "interactive_play_distracted",
      "topic": "child_dev",
      "icon_asset": "images/icons/picture_book.svg",
      "slide_1_text": "A mother is busy on the phone.",
      "slide_2_text": "Her son David keeps talking to her trying to get her attention to join and enjoy play.",
      "slide_3_text": "The child gets disappointed and annoyed.",
      "attached_single_doc": "https://docs.google.com/document/d/1H5gFW_si9jaLurJhhwrv-tVqv2akY2WR3Gsy9S5Av98"
    },
    {
      "id": "interactive_play_control",
      "topic": "child_dev",
      "slide_1_text": "A father finds his daughter Birungi playing and asks to join.",
      "slide_2_text": "In the process, the father insists that the child should play his way since he knows the game better.",
      "slide_3_text": "The child gets frustrated and goes away."
    },
    {
      "id": "interactive_child_lead",
      "topic": "child_dev",
      "slide_1_text": "Doreen is interested in doing something that the mother knows is not timely as Dorren had to complete other tasks.",
      "slide_2_text": "She joins the child's playtime and tries to learn from her about the different components of the game. They end up enjoying the play as the mother keeps learning from the child.",
      "slide_3_text": "After a few minutes, Doreen is asked to go and complete her homework exercise which was provided by the school teacher."
    },
    {
      "id": "outstanding_abilities",
      "topic": "parent_childhood",
      "gender": "men",
      "intro_text": "Here's a story of a supportive father in child care.",
      "slide_1_text": "Mr. Ssemakula is married with four children. He actively plays a strong role in day-to-day child-care and his wife appreciates him for his father figure involvement.",
      "slide_2_text": "Whenever the wife delivers and the baby is about 2 - 3 weeks, he takes turns with his wife to carry the crying baby in the night.",
      "slide_3_text": "He picks up any opportunity in his busy schedule to cuddle with his children including finding play time for out and indoor games.",
      "slide_4_text": "Within their limited resources, his family seems happy and healthy. On most weekends, the family works and eats together."
    },
    {
      "id": "managing_behaviour",
      "topic": "positive_parenting",
      "slide_1_text": "Sarah was trying to get her brother to play with her.",
      "slide_1_image_asset": "images/managing_difficult_behaviour_1.jpg",
      "slide_2_text": "Give it to me.",
      "slide_2_image_asset": "images/managing_difficult_behaviour_2.jpg",
      "slide_3_text": "Sarah, please give the bricks back to your brother",
      "slide_3_image_asset": "images/managing_difficult_behaviour_3.jpg",
      "slide_4_text": "Waaaah, maama (baby crying).",
      "slide_4_image_asset": "images/managing_difficult_behaviour_4.jpg",
      "slide_5_text": "\"Sarah, if you cannot play nicely with your brother, I will tell your father.\"",
      "slide_5_image_asset": "images/managing_difficult_behaviour_5.jpg"
    },
    {
      "id": "setting_limits",
      "topic": "positive_parenting",
      "slide_1_text": "Mother: \"Sam, you have been coming home from playing with your friends after sunset.\"",
      "slide_1_image_asset": "images/limits_for_children_1.jpg",
      "slide_2_text": "Mother: \"It is too dangerous in the community after dark. From now on, our household rule is that you need to come home before sunset, okay?\"",
      "slide_2_image_asset": "images/limits_for_children_2.jpg",
      "slide_3_text": "Mother: \"Thank you, Sam, for coming before sunset. Tomorrow let's go to soccer match together.\"",
      "slide_3_image_asset": "images/limits_for_children_3.jpg"
    },
    {
      "id": "impact_conflict",
      "topic": "impact_conflict",
      "slide_1_text": "Susan and her husband John have a troublesome son, Henry, who is 11 years old. Henry is very energetic and creative. However, he often gets into trouble at school.",
      "slide_2_text": "On weekends and even on some school days, Henry escapes from home to watch movies. Susan’s husband often blames her for Henry’s bad behaviour saying that she spends too much time at her job, when she should be home more, watching over the children.",
      "slide_3_text": "One day Susan and her husband got into a heated argument and he hit her. He often did so but this time, Susan decided that she could not take it anymore. She lashes out at Henry and beats him up, blaming him for always bringing her problems.",
      "slide_4_text": "A male neighbour passed but did not say anything. As Susan contemplated leaving, she thought about her children and got discouraged, saying the children would suffer without her."
    },
    {
      "id": "rships_communication",
      "topic": "healthy_relation",
      "title": "Story Time",
      "slide_1_text": "“But I did not do anything wrong, we are just friends”, Chris insisted when a family member voiced concern over the time he was spending with the girl working in the bar and restaurant. In Chris’s mind, he had not crossed any lines because there was nothing much that was happening. “I only tap her bat sometimes, just for fun, and I have no problem spending time with someone who cooks and serves us food and beer very well, daily.",
      "slide_2_text": "Chris and his wife Kevin have been happily married for 7 years. But Kevin is argumentative and sometimes, an aggressive talker, who tries to win every argument. She cannot sustain a good discussion and often threatens to leave her husband because of his behaviour, especially physical and emotional violence including non-involvement in child care. Chris often feels lonely even when they are together. As a result of this, they have problems in their intimate relationships and each of them does not get sufficient intimate satisfaction (sex) but they do not talk about it. Both of them have challenges with their body hygiene including brushing, shaving, bathing, cutting nails among others. The couple has developed drinking habits to try to feel relaxed but this makes it worse as they end in fights and quarrels before the children.",
      "slide_3_text": "The restaurant girl, however, is a good listener and easily reads Chris’s moods. She is quick to laugh with him and is fun to have around. As the two continued to spend time together, a friend to whom Chris had casually told about the relationship mentioned it to Kevin. When Kevin confronted Chris, he dismissed her concerns. Kevin was so disturbed and decided to fight her husband and the bar girl."
    },
    {
      "id": "spousal_relationships",
      "topic": "session_review",
      "title": "Story Time",
      "slide_1_text": "A mother was bathing a child when the father returned home and asked to be served tea.",
      "slide_2_text": "Patiently, she explained that she was still busy bathing the child, and that the other children were also waiting to be bathed.",
      "slide_3_text": "She asked the husband to come and bathe the children as she goes to prepare tea for him. The father agreed and took over this responsibility. A few minutes later, the tea was ready.",
      "slide_4_text": "A neighbour who was then passing by saw this and was impressed to see a father bathing his child as their mother served tea. He wondered how they were able to share the roles easily.",
      "slide_5_text": "The couple told him that they had benefited from attending Parenting for Respectability sessions."
    },
    {
      "id": "conflict_children",
      "topic": "discipline",
      "intro_text": "While raising our children, especially adolescents, it is easy to get into a confrontation with them. For instance, this can happen when parents set limits and regulate their children’s behavior. However, confrontation or conflict can often be avoided"
    },
    {
      "id": "positive_child_interaction_1",
      "topic": "discipline",
      "slide_1_text": "It's so nice to see you playing with your dolls Sylia.",
      "slide_1_image_asset": "images/sylvia_playing_with_toys_1.jpg",
      "slide_2_text": "In five minutes, it will be time for keeping them.",
      "slide_2_image_asset": "images/sylvia_playing_with_toys_2.jpg",
      "slide_3_text": "It's time for keeping your dolls Sylvia. Please keep them in the box, I would like to tell you a story.",
      "slide_3_image_asset": "images/sylvia_playing_with_toys_3.jpg",
      "slide_4_text": "Please pack them properly.",
      "slide_4_image_asset": "images/sylvia_playing_with_toys_4.jpg",
      "slide_5_text": "Thank you for removing the dolls when I told you. I am so grateful because you listen to what I say. Now, let's read a story together.",
      "slide_5_image_asset": "images/sylvia_playing_with_toys_5.jpg",
      "slide_6_text": "Once upon a time.....",
      "slide_6_image_asset": "images/sylvia_playing_with_toys_6.jpg"
    },
    {
      "id": "positive_child_interaction_2",
      "topic": "discipline",
      "slide_1_text": "Radio presenter: At the end of 1st half, Arsenal and Man u",
      "slide_2_text": "<span><i>Music playing: la la la... la la la... la la la!...<br/><br/></i></span><span>Dad: Moses, thank you for playing quietly down there, I loved it</span>",
      "slide_3_text": "Radio presenter: 2-2 The game is over",
      "slide_4_text": "Dad: You have played very well, you were quite while I was listening to my program, Thank you Moses."
    },
    {
      "id": "patnership_parenting",
      "topic": "gender_equal",
      "title": "Missing story: To be added"
    },
    {
      "id": "encourage_school",
      "topic": "education",
      "title": "Story",
      "slide_1_text": "Nakato is a 13 year- old girl in Primary7 in a certain school.",
      "slide_2_text": "She tries to work hard but received a very low mark in the mid-year examinations.",
      "slide_3_text": "That same day, her parents found out that there is a man in the neighborhood who has been pestering Nakato to have a love relationship with him, and even promised to marry her.",
      "slide_4_text": "Just before examinations, Nakato’s teacher had tried to contact the parents regarding her academics, but the parents were busy."
    }
  ],
  "_xlsxPath": "global/data_lists/topics.xlsx"
}